{
  "executive_summary": "The 89th parliamentary meeting in the Netherlands on May 28, 2025 addressed a range of topics, including combating misogynistic content on social media, funding for women's shelters, and legislation related to digital shareholder engagement. While some motions were temporarily withheld or not supported, the government committed to providing progress reports and further assessments on these issues.",
  "main_topics": [
    {
      "topic": "Addressing online misogyny",
      "summary": "The debate discusses a motion regarding an effective approach to combating misogynistic content on social media. The motion is temporarily withheld to allow for further consideration. The State Secretary indicates that a progress report on this issue will be provided in June.",
      "party_positions": {
        "GroenLinks-PvdA": "Supports the need for an effective approach to address misogynistic content on social media.",
        "State Secretary": "Indicates that a progress report on this issue will be provided in June, and does not want to make any firm commitments at this stage."
      },
      "outcome": "The motion is temporarily withheld to allow for further consideration."
    },
    {
      "topic": "Funding for women's shelters",
      "summary": "A motion is discussed regarding the need for sufficient funding and support for women's shelters. The State Secretary indicates that this falls under the responsibility of the State Secretary for Long-Term and Social Care, but she will still provide an assessment of the motion.",
      "party_positions": {
        "SP": "Supports the need for adequate funding and support for women's shelters."
      },
      "outcome": "The State Secretary indicates that the issue of women's shelters falls under the responsibility of the State Secretary for Long-Term and Social Care, but she will provide an assessment of the motion."
    },
    {
      "topic": "Online sexual violence",
      "summary": "The State Secretary indicates that a cabinet response to a report on online sexual violence will be provided to the House of Representatives, but the motion on this topic is not supported.",
      "party_positions": {},
      "outcome": "The cabinet response to the report on online sexual violence will be provided to the House of Representatives, but the motion on this topic is not supported."
    },
    {
      "topic": "Legislation on digital shareholder engagement",
      "summary": "The GroenLinks-PvdA member expresses concern that some companies may choose to go fully digital to avoid activist shareholders and difficult questions, to which the Secretary of State agrees that this would be undesirable and states that the legislation will be evaluated for such unintended effects.",
      "party_positions": {
        "GroenLinks-PvdA": "Expresses concern that some companies may choose to go fully digital to avoid activist shareholders and difficult questions.",
        "Staatssecretaris Rechtsbescherming": "Agrees that this would be undesirable and states that the legislation will be evaluated for such unintended effects."
      },
      "outcome": "The legislation will be evaluated for potential unintended effects related to companies going fully digital to avoid shareholder engagement."
    }
  ],
  "key_decisions": [
    "The motion regarding an effective approach to combating misogynistic content on social media is temporarily withheld to allow for further consideration.",
    "The State Secretary indicates that the issue of women's shelters falls under the responsibility of the State Secretary for Long-Term and Social Care, but she will provide an assessment of the motion.",
    "The State Secretary indicates that a cabinet response to a report on online sexual violence will be provided to the House of Representatives, but the motion on this topic is not supported.",
    "The government gives its judgement on the motions discussed, including motion 288 on kill switches and motion 289 on the role of the Reddingsbrigade."
  ],
  "political_dynamics": "The meeting showed a mix of agreement and disagreement among the various political parties, with the government taking a cautious approach on some issues and committing to further assessments and progress reports. There was also a focus on addressing concerns related to online misogyny, women's shelters, and the potential unintended effects of legislation on digital shareholder engagement.",
  "next_steps": [
    "The government will provide a progress report on addressing misogynistic content on social media in June.",
    "The State Secretary for Long-Term and Social Care will continue discussions with relevant stakeholders on the issue of funding and support for women's shelters.",
    "The government will provide a cabinet response to the report on online sexual violence to the House of Representatives.",
    "The legislation on digital shareholder engagement will be evaluated for potential unintended effects."
  ],
  "meeting_info": {
    "vergadering_titel": "89e vergadering, woensdag 28 mei 2025",
    "vergadering_datum": "2025-05-28T00:00:00+02:00",
    "verslag_id": "c4f9fd24-03b1-4038-8bad-9cf496baad44",
    "status": "VerslagStatus.ONGECORRIGEERD"
  },
  "processing_info": {
    "chunks_processed": 11,
    "total_topics_found": 17,
    "processing_date": "2025-06-03T22:45:05.759737"
  }
}